// See https://aka.ms/new-console-template for more information
// Console.WriteLine("Hello, World!");

/* ЗАДАЧА: напишите программу, которая принимает на вход число и выдает сумму цифр в числе.
452 -> 11
82 -> 10 
9012 -> 12
*/

